albert.tabout
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-ssh
arcticicestudio.nord-visual-studio-code
avetis.tokyo-night
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
cardinal90.multi-cursor-case-preserve
catppuccin.catppuccin-vsc
christian-kohler.npm-intellisense
ckolkman.vscode-postgres
csstools.postcss
databricks.neon-local-connect
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
fisheva.eva-theme
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.github-vscode-theme
golang.go
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
hashicorp.terraform
marlosirapuan.nord-deep
mathiasfrohlich.kotlin
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.debugpy
ms-python.isort
ms-python.python
mtxr.sqltools
mylesmurphy.prettify-ts
openai.chatgpt
orta.vscode-twoslash-queries
oxc.oxc-vscode
prisma.prisma
redhat.vscode-xml
remcohaszing.schemastore
richie5um2.vscode-sort-json
rust-lang.rust-analyzer
stkb.rewrap
sumneko.lua
tobermory.es6-string-html
tyriar.sort-lines
vitest.explorer
wix.vscode-import-cost
yoavbls.pretty-ts-errors
yukina.yukinord
zhuangtongfa.material-theme
